{
    "version": "https://jsonfeed.org/version/1",
    "title": "Bean Boat",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": "Something needs to happen!",
    "icon": "http://localhost:4000/apple-touch-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    
"items": [
    
        {
            "id": "http://localhost:4000/2022/07/10/one-month-into-confluent",
            "title": "One month into Confluent",
            "summary": "What is the difference between various font formats?",
            "content_text": "I left Google and joined Confluent about one month ago. All my career years have been spent in large corporations. Working for a company of Confluent’s size is a brand new experience. I am documenting my discoveries and surprises before I get too used to the new world.ToolingsGoogle has such a large range of products that most of the day-to-day tools we use are created within the company, such as video conferencing, collaborative documentations, and etc. The rest of the gaps are mostly filled by other large companies, such as SAP Concur. I did expect smaller companies to rely more on third party vendors. But the actual amount and variety were astonishing. Just to give some examples, they have apps for initialling, communicating, and tracking immigration stuff, for giving feedback, and for managing flags used in code.It appears they picked the vendors who are also in the startup or small business world, possibly to support each other. These businesses along with Confluent could probably form an ecosystem where the cash flows.I have to mention that they have a central system Okta that is responsible for authentication to everything. It works smoothly and simplistically. Coming from a place where there are extremely strict security rules, as well as tools that enforce the rules, I felt the “freedom”.Operating systemsI was thrilled when I got the IT questionnaire that asked to pick a laptop between MacBook pro 16” and Thinkpad P15 - those are very powerful and expensive machines. At a second thought, I was wondering if we would be developing on the laptop directly. And the answer is yes.The model used in many big IT companies is desktop / cloud instance + laptop, for performance and security reasons. So the laptops they provide are usually mid-tier, as they are often just for emails and browsing.I got the most powerful laptop ever in my life. It is also so heavy that it is not really portable. I installed Linux on it, and found out most software engineers in the company develop on Mac OS. Having been a Mac user for a long time, I got annoyed from time to time when it came to coding directly on Mac. The best alternative was to turn on the laptop and ssh-ing to a Linux box, which is also how I did my job all the time. So it was probably the biggest culture shock when joining Confluent.Development environmentsI had a few PRs merged and had my hands dirty on so many different tools that I have read about or first heard of. I think the overall experience in Google is more fluent, mainly because of the mono repo. Confluent uses GitHub and microservice architecture, as a result, code is spread across multiple repos. Refactoring or code sharing becomes much harder than back in Google. I will talk more about it in a future post, as I make progress in first project, which is a service migration and involves large amount of refactoring.I am still exploring the “soft” side of the new company. Maybe I will share more later.",
            "content_html": "<p>I left Google and joined Confluent about one month ago. All my career years have been spent in large corporations. Working for a company of Confluent’s size is a brand new experience. I am documenting my discoveries and surprises before I get too used to the new world.</p><h2 id=\"toolings\">Toolings</h2><p>Google has such a large range of products that most of the day-to-day tools we use are created within the company, such as video conferencing, collaborative documentations, and etc. The rest of the gaps are mostly filled by other large companies, such as SAP Concur. I did expect smaller companies to rely more on third party vendors. But the actual amount and variety were astonishing. Just to give some examples, they have apps for initialling, communicating, and tracking immigration stuff, for giving feedback, and for managing flags used in code.</p><p>It appears they picked the vendors who are also in the startup or small business world, possibly to support each other. These businesses along with Confluent could probably form an ecosystem where the cash flows.</p><p>I have to mention that they have a central system <code class=\"language-plaintext highlighter-rouge\">Okta</code> that is responsible for authentication to everything. It works smoothly and simplistically. Coming from a place where there are extremely strict security rules, as well as tools that enforce the rules, I felt the “freedom”.</p><h2 id=\"operating-systems\">Operating systems</h2><p>I was thrilled when I got the IT questionnaire that asked to pick a laptop between MacBook pro 16” and Thinkpad P15 - those are very powerful and expensive machines. At a second thought, I was wondering if we would be developing on the laptop directly. And the answer is yes.</p><p>The model used in many big IT companies is desktop / cloud instance + laptop, for performance and security reasons. So the laptops they provide are usually mid-tier, as they are often just for emails and browsing.</p><p>I got the most powerful laptop ever in my life. It is also so heavy that it is not really portable. I installed Linux on it, and found out most software engineers in the company develop on Mac OS. Having been a Mac user for a long time, I got annoyed from time to time when it came to coding directly on Mac. The best alternative was to turn on the laptop and ssh-ing to a Linux box, which is also how I did my job all the time. So it was probably the biggest culture shock when joining Confluent.</p><h2 id=\"development-environments\">Development environments</h2><p>I had a few PRs merged and had my hands dirty on so many different tools that I have read about or first heard of. I think the overall experience in Google is more fluent, mainly because of the mono repo. Confluent uses GitHub and microservice architecture, as a result, code is spread across multiple repos. Refactoring or code sharing becomes much harder than back in Google. I will talk more about it in a future post, as I make progress in first project, which is a service migration and involves large amount of refactoring.</p><p>I am still exploring the “soft” side of the new company. Maybe I will share more later.</p>",
            "url": "http://localhost:4000/2022/07/10/one-month-into-confluent",
            
            
            
            
            
            "date_published": "2022-07-10T00:00:00-07:00",
            "date_modified": "2022-07-10T00:00:00-07:00",
            
                "author": 
                ""
                
            
        }
    
    ]
}